print("输入您的月薪金额，将显示该月需要交的所得税金额与您的税后工资") 
q = float(input("请输入月薪金额："))
a1 = 0.03 #3000
b2 = 0.1  #3000-12000
c3 = 0.2  #12000-25000
d4 = 0.25 #25000-35000
e5 = 0.3  #35000-55000
f6 = 0.35 #55000-80000
g7 = 0.4  #80000
l = 5000 #5000数字
m = q-5000 # 五千后的工资
ts5000 = q*1 # 五千 无税
if q<=5000:
    print("您的税额为:0!您的工资为：",q)
else:
    a11 = m*0.03 # 五千后的税
    a12 = q-a11 #工资减税
    a13 = a12+5000  #工资加5000
if q>=5001 and q<=7999:
    print("您的税额为:",a11,"您的工资为：",a12)
else:
    b21 = m*0.1 
    b22 = q-b21 
    b23 = b22+5000 
if q>=8000 and q <= 11999:
    print("您的税额为:",b21,"您的工资为：",b22)
else:
    c31 = m*0.2
    c32 = q-c31
    c33 = b22+5000
if q>=12000 and q <= 24999:
    print("您的税额为:",c31,"您的工资为：",c32)
else:
    d41 = m*0.25
    d42 = q-d41
    d43 = d42+5000
if q>=25000 and q <= 34999:
    print("您的税额为:",d41,"您的工资为：",d42)
else:
    e51 = m*0.3
    e52 = q-e51
    e53 = e52+5000
if q>=35000 and q <= 54999:
    print("您的税额为:",e51,"您的工资为：",e52)
else:
    f61 = m*0.35
    f62 = q-f61
    f63 = f62+5000
if q>=55000 and q <= 79999:
    print("您的税额为:",f61,"您的工资为：",f62)
else:
    g71 = m*0.4
    g72 = q-g71
    g73 = g72+5000
if q >= 80000:
    print("您的税额为:",g71,"您的工资为：",g72)